---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DataTransferProgressChangedEventArgs Properties
DataTransferProgressChangedEventArgs Class See Also Send Feedback
---

The DataTransferProgressChangedEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
|  | FinishedSize | The transferred data size, in bytes, since the last time this event was raised. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
|  | Location | Full path of the central model which is to be operated.  (Inherited from WorksharedOperationProgressChangedEventArgs.) |
|  | Speed | Speed(bytes/second) in this event. |
|  | Status | Gets API event status, reflect current operation execution status.  (Inherited from WorksharedOperationProgressChangedEventArgs.) |
|  | TotalSize | Total expected data size to transfer, in bytes. |
|  | TransferMode | Data transfer mode in this event. |

# See Also

DataTransferProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace